# A/B testing de visitas de usuarios a una web de retail

https://www.kaggle.com/datasets/adarsh0806/ab-testing-practice

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import seaborn as sns
import scipy.stats as stats
import statsmodels as sms
from src import soporte_abtesting as sa

In [2]:
# Importamos el set de datos
df = pd.read_csv("data/ab_testing_proyecto.csv", sep = ",")
df.head()

   User ID Group  Page Views  Time Spent Conversion   Device          Location
0    14292     B           3         424         No   Mobile  Northern Ireland
1    11682     A           9         342         No   Mobile          Scotland
2    19825     A           2         396         No  Desktop  Northern Ireland
3    16080     B           4         318         No  Desktop             Wales
4    18851     A           1         338        Yes  Desktop          Scotland

In [3]:
# Creamos uan copia del dataset
data = df.copy()
data.head()

   User ID Group  Page Views  Time Spent Conversion   Device          Location
0    14292     B           3         424         No   Mobile  Northern Ireland
1    11682     A           9         342         No   Mobile          Scotland
2    19825     A           2         396         No  Desktop  Northern Ireland
3    16080     B           4         318         No  Desktop             Wales
4    18851     A           1         338        Yes  Desktop          Scotland

In [ ]:
# Vemos informaci√≥n del dataset
sa.info_df(data)

           Tipo_dato  numero_registros  Numero_nulos  %_nulos
User ID        int64              5000             0      0.0
Group         object              5000             0      0.0
Page Views     int64              5000             0      0.0
Time Spent     int64              5000             0      0.0
Conversion    object              5000             0      0.0
Device        object              5000             0      0.0
Location      object              5000             0      0.0

In [ ]:
# Revisamos que no haya duplicados
data.duplicated().sum()

np.int64(0)

In [9]:
sa.estadisticos_numericas_df(data)

,count,mean,std,min,25%,50%,75%,max,Mediana,Moda,Curtosis,Coef_asimetria
User ID,5000.0,14925.16,2869.15,10001.0,12456.25,14858.5,17379.75,19995.0,14858.5,NaN,-1.18,0.04
Page Views,5000.0,7.54,4.02,1.0,4.00,8.0,11.00,14.0,8.0,NaN,-1.20,-0.02
Time Spent,5000.0,242.51,118.25,40.0,137.00,243.0,346.00,449.0,243.0,NaN,-1.22,0.00